results/routeA/initialization_check/Ra1e4_coarse/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-2.168404344971009e-19
-2.168404344971009e-19
2.168404344971009e-19
-4.336808689942018e-19
-2.168404344971009e-19
-4.336808689942018e-19
-2.168404344971009e-19
4.336808689942018e-19
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
-2.168404344971009e-19
8.673617379884035e-19
1.734723475976807e-18
1.734723475976807e-18
0
3.469446951953614e-18
0
-3.469446951953614e-18
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
2.168404344971009e-19
8.673617379884035e-19
0
0
-3.469446951953614e-18
-6.938893903907228e-18
-6.938893903907228e-18
-6.938893903907228e-18
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
0
0
0
0
0
0
-2.775557561562891e-17
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
